# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# выведите на экран.

number = 1
text = 'здесь будут буквы'

print(number)
print(text)
number = input('введите новое число\n')
text = input('введите новую строку\n')
number_2 = input('введите еще число\n')
text_2 = input('введите еще текст\n')
print('теперь новое число - '+number+'второе число - '+number_2)
print('теперь новая строка - '+text+'вторая строка - '+text_2)
